{
  "skills": {

    "programming": "Java, Spring Boot, JDBC, Restful Microservices, HTML, CSS, JavaScript, jQuery, Angular, Thyme Leaf, Python, C#, and .NET, WPF, UWP, WCF, ADO.NET, Entity Framework and Datasets in C#.",
    "database": "SQL, MySQL, Microsoft SQL Server, Oracle SQL Developer PL/SQL, Redis, NoSQL, MongoDB, Hash Tables, Redis, HSQL and Data Integration.",
    "dev-ops": "Eclipse, IntelliJ Idea, VS Code, VS Studio, Jenkins, Pivotal Cloud Foundry, Kibana Logging and Postman.",
    "office": "Outlook, Word, Excel, and PowerPoint."

  },

  "services": {
    "web-appllication-development": "Web app development by using modern web design and css. This also inlucdes functions or libraries used for modern deveopment such as Agular, jQuery, Node etc.",
    "web-design": "Web design, web graphic design, user interface design, including standardized code and proprietary software, user experience design and search engine optimization.",
    "api-development": "Application programming interface development using Java, Spring Boot, JDBC, Restful Microservices and any frontend webpages.",
    "api-deployment": "Deployment through deployments tools like Jenkins, Urban Code Deploy, Pivotal Cloud Foundry and Ansible."

  },

  "projects": {

    "project-1": {
      "img": "../images/project1.JPG",
      "name": "Portfolio",
      "description": "Used HTML, CSS, jQuery to develop a dynamic web application with functional features like resume download and contact with email capabilities. Resulted in a modern portfolio with good looking CSS and web page design full of information."
    },

    "project-2": {
      "img": "../images/project2.jpg",
      "name": "CyberKnox",
      "description": "A group project to demonstrate spring boot framework implementation. A dummy banking app to use MySQL database to store users and encrypted login information. This application uses spring web, spring data jdbc, spring security and thymeleaf to perform dummy operation like a bank."
    },

    "project-3": {
      "img": "../images/project3.jpg",
      "name": "MarketBot",
      "description": "Implemented a Slack Bot with the functional capability of requesting access to different services using RBC’s access request platform. Solution for easy and bulk access requests and were prized 1st place for business scope lean canvas."
    }
  },


  "about": "As a computer science student, I had many opportunities to learn and improve my skills in various fields. I worked at the Royal Bank of Canada for my coop term, and it enhanced up my understanding of business. I was hired as a Technical Systems Analyst, and I had many opportunities to deal with clients and understand their requirements to build applications. I interacted with Business Systems analysts daily to understand client requests and then discuss changes or implementation plans with my team and my manager as team opinion is crucial for final product effectiveness.<br><br> I had many opportunities to put my knowledge to practice use. The most renounced achievement was that I had a task to convert at a static application to a dynamic one. This application was responsible for storing status data about various APIs deployed by my team in different working DevOps environments. It had two main pages, main page and edit page. As it was a static application, it did not have any database connection or a security layer to prevent unwanted altering of the data.<br> <br> I can say this as my top accomplishment during my time at RBC. I learned to schedule my tasks and plan out its execution. I also molded my mind to enhance critical thinking. These helped me excel and grow as an employee. We typically followed scrum techniques. I would get tasks assigned from sprint meetings, and if I particularly want to implement something, I could create my own stories(tasks). "

}
